Catalogs/ИдентификаторыСтрокИнтернетЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыСтрокИнтернетЗаявок</Name>
			<Comment>Содержит связку текстовая строка - идентификатор этой строки как ГУИД элемента справочника</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МодифицированнаяСтрока</Name>
					<Comment>Используется для поиска, не содержит пробелов, все символы в нижнем регистре</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>140</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписываемыйОбъект</Name>
					<Comment>Не используется</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПолнуюСтроку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолнаяСтрока</Name>
					<Comment>В отиличие от наименования длина данной строки не ограничена</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИдентификаторыСтрокИнтернетЗаявок/Ext/ManagerModule.bsl
Функция УстановиИдентификаторСтроки(ИсходнаяСтрока, ОписываемыйОбъект="", ПолнаяСтрока = "") Экспорт
	
	ЗначениеПоУмолчанию = Справочники.ИдентификаторыСтрокИнтернетЗаявок.ПустаяСсылка();
	
	Если ТипЗнч(ИсходнаяСтрока)<> Тип("Строка") Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
		 
	 МодифицированнаяСтрока = Конвертация.МодифицироватьСтроку(ИсходнаяСтрока);
	 
	 Если СтрДлина(МодифицированнаяСтрока) = 0 Тогда
		 Возврат ЗначениеПоУмолчанию;
	 КонецЕсли;
		
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрокИнтернетЗаявок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.МодифицированнаяСтрока ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", МодифицированнаяСтрока);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат РезультатЗапроса.Выгрузить()[0][0];
	Иначе
		НоваяЗапись = Справочники.ИдентификаторыСтрокИнтернетЗаявок.СоздатьЭлемент();
	 	НоваяЗапись.Наименование			=	ИсходнаяСтрока;
		НоваяЗапись.МодифицированнаяСтрока	=	МодифицированнаяСтрока;
		НоваяЗапись.ОписываемыйОбъект		=	ОписываемыйОбъект;
		
		Если СтрДлина(ИсходнаяСтрока)>150 И ПолнаяСтрока <>"" Тогда
			НоваяЗапись.ИспользоватьПолнуюСтроку = Истина;
		КонецЕсли;
		
		Если ПолнаяСтрока="" Тогда
			НоваяЗапись.ПолнаяСтрока		=	ИсходнаяСтрока;
		Иначе
			НоваяЗапись.ПолнаяСтрока		=	ПолнаяСтрока;
		КонецЕсли;
		
	 	НоваяЗапись.Записать();
		Возврат НоваяЗапись.Ссылка;
	КонецЕсли;
	
КонецФункции
